&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Объект.Дата = ТекущаяДата();
	Объект.Город = Справочники.Города.Москва;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачатьПолучениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ГородПриИзменении(Элемент)
	НачатьПолучениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	НачатьПолучениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеДанных()

	Если НачалоДня(Объект.Дата) < НачалоДня(ТекущаяДата()) Тогда
		ПоказатьПредупреждение( , "Прогноз на прошедшие даты недоступен");
		Возврат;
	ИначеЕсли (НачалоДня(Объект.Дата) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24) > 7 Тогда
		ПоказатьПредупреждение( , "Прогноз доступен на 7 дней");
		Возврат;
	КонецЕсли;

	ПроверитьЗаполненностьРеквизитов();
	ГородСтрока = НРег(СокрЛП(Объект.Город));
	ПолучитьДанныеОПогодеКлиент(ГородСтрока, Объект.Дата, ПроизошлаОшибка, ТекстОшибки);

	Если ПроизошлаОшибка Тогда
		ПоказатьПредупреждение( , ТекстОшибки);
		СброситьПредыдущиеОшибки();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполненностьРеквизитов()

	Если Не ЗначениеЗаполнено(Объект.Город) Тогда
		Объект.Город = ПредопределенноеЗначение("Справочник.Города.Москва");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СброситьПредыдущиеОшибки()
	ТекстОшибки     = "";
	ПроизошлаОшибка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеОПогодеКлиент(Город, Дата, ПроизошлаОшибка, ТекстОшибки)

	ЭтоТекущийПериод = НачалоДня(Дата) = НачалоДня(ТекущаяДата());
	УстановитьВидимостьРеквизитовПериода(ЭтоТекущийПериод);
	УстановитьЗаголовокТаблицыТемператур(ЭтоТекущийПериод);
	
	ПолучитьДанныеОПогодеСервер(Город, Объект.Дата, ПроизошлаОшибка, ТекстОшибки,ЭтоТекущийПериод);
	
	Если Не ПроизошлаОшибка Тогда

		Если ЭтоТекущийПериод Тогда
			ТемператураПоложительна = СтрНайти(Объект.ТекущаяТемпература, "+") > 0;
			ВидимостьПлюс = ТемператураПоложительна;
			ВидимостьМинус = Не ТемператураПоложительна;
			Элементы.ДекорацияПлюс.Заголовок = Объект.ТекущаяТемпература;
			Элементы.ДекорацияМинус.Заголовок = Объект.ТекущаяТемпература;
		Иначе
			ВидимостьПлюс  = Ложь;
			ВидимостьМинус = Ложь;
			Элементы.ДекорацияТемператураБудущийПериод.Видимость = Истина;
			Элементы.ДекорацияТемператураБудущийПериод.Заголовок = СтрШаблон("%1 - %2  С", Объект.min, Объект.max);
		КонецЕсли;
		
		УстановитьВидимостьЗнакаТемпературы(ВидимостьПлюс, ВидимостьМинус);
		УстановитьМаксМинЗначенияОсей();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьМаксМинЗначенияОсей()
	
	ГрафикТемпературы.ОсьЗначений.СпособОпределенияМинимальногоЗначения  = 
												СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
	ГрафикТемпературы.ОсьЗначений.СпособОпределенияМаксимальногоЗначения = 
												СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
	ГрафикТемпературы.ОсьЗначений.МаксимальноеЗначение = Объект.max + 10;
	ГрафикТемпературы.ОсьЗначений.МинимальноеЗначение = Объект.min - 5;
//	ГрафикТемпературы.ОсьЗначений.МаксимальноеЗначение = 60;
//	ГрафикТемпературы.ОсьЗначений.МинимальноеЗначение = -25;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьРеквизитовПериода(ЭтоТекущийПериод)
	УстановитьВидимостьЗнакаТемпературы(ЭтоТекущийПериод, ЭтоТекущийПериод);
	Элементы.ДекорацияТемператураБудущийПериод.Видимость = Не ЭтоТекущийПериод;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЗнакаТемпературы(ВидимостьПлюс, ВидимостьМинус)
	Элементы.ДекорацияМинус.Видимость       = ВидимостьМинус;
	Элементы.ДекорацияПлюс.Видимость        = ВидимостьПлюс;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокТаблицыТемператур(ЭтоТекущийПериод)

	Элементы.ТаблицаДанныхКолонка0.Заголовок = ?(ЭтоТекущийПериод, "0:00", "Ночь");
	Элементы.ТаблицаДанныхКолонка1.Заголовок = ?(ЭтоТекущийПериод, "3:00", "Утро");
	Элементы.ТаблицаДанныхКолонка2.Заголовок = ?(ЭтоТекущийПериод, "6:00", "День");
	Элементы.ТаблицаДанныхКолонка3.Заголовок = ?(ЭтоТекущийПериод, "9:00", "Вечер");

	Элементы.ТаблицаДанныхКолонка4.Видимость = ЭтоТекущийПериод;
	Элементы.ТаблицаДанныхКолонка5.Видимость = ЭтоТекущийПериод;
	Элементы.ТаблицаДанныхКолонка6.Видимость = ЭтоТекущийПериод;
	Элементы.ТаблицаДанныхКолонка7.Видимость = ЭтоТекущийПериод;

КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеОПогодеСервер(Город, Дата, ПроизошлаОшибка, ТекстОшибки,ЭтоТекущийПериод)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СтруктураРезультат = ОбработкаОбъект.ПолучитьДанныеОПогоде(Город, Объект.Дата, ПроизошлаОшибка, ТекстОшибки);

	Если Не СтруктураРезультат = Неопределено Тогда
		ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
		ЗаполнитьТаблицуДанных(СтруктураРезультат,ЭтоТекущийПериод);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДанных(СтруктураРезультат,ЭтоТекущийПериод)

	Объект.max = 0;
	Объект.min = 0;

	Объект.ТаблицаДанных.Очистить();
	ГрафикТемпературы.Очистить();
	НастроитьДиаграмму(ЭтоТекущийПериод);

	Для Каждого ТекПоказатель Из СтруктураРезультат Цикл

		ТекСтрока = Объект.ТаблицаДанных.Добавить();
		ТекСтрока.КолонкаОписание = ТекПоказатель.Ключ;
		Сч = 0;

		Для Каждого текКолонка Из ТекПоказатель.Значение Цикл

			Если Сч > 7 Тогда
				Возврат;
			КонецЕсли;

			ТекСтрока["Колонка" + Сч] = текКолонка;
			Если ТекПоказатель.Ключ = "Температура" Тогда

				ЧисловоеЗначение = ПреобразоватьТекстВЧисло(ТекСтрока["Колонка" + Сч]);
				Объект.max = ?(Объект.max > ЧисловоеЗначение, Объект.max, ЧисловоеЗначение);
				Объект.min = ?(Объект.min < ЧисловоеЗначение, Объект.min, ЧисловоеЗначение);

				ГрафикТемпературы.УстановитьЗначение(Сч, 0, ЧисловоеЗначение, ТекСтрока["Колонка" + Сч]);

			ИначеЕсли ТекПоказатель.Ключ = "Ощущается" Тогда

				ЧисловоеЗначение = ПреобразоватьТекстВЧисло(ТекСтрока["Колонка" + Сч]);
				ГрафикТемпературы.УстановитьЗначение(Сч, 1, ЧисловоеЗначение, ТекСтрока["Колонка" + Сч]);

			КонецЕсли;

			Сч = Сч + 1;

		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДиаграмму(ЭтоТекущийПериод)
	ГрафикТемпературы.ОбластьЗаголовка.Текст = "Изменение температуры";
	ГрафикТемпературы.ОбластьЗаголовка.ПрозрачныйФон = Истина;
	ГрафикТемпературы.ОбластьЗаголовка.Шрифт = Новый Шрифт("Arial",14, Ложь,Истина);
	ГрафикТемпературы.ОбластьЗаголовка.Расположение = РасположениеОбластиЗаголовкаДиаграммы.Верх;
	
	ГрафикТемпературы.Серии.Вставить(0, "Температура");
	ГрафикТемпературы.Серии.Вставить(1, "Ощущается");

	ГрафикТемпературы.Точки.Добавить(0);
	ГрафикТемпературы.Точки[0].Текст = ?(ЭтоТекущийПериод, "0:00", "Ночь");
	ГрафикТемпературы.Точки.Добавить(1);
	ГрафикТемпературы.Точки[1].Текст = ?(ЭтоТекущийПериод, "3:00", "Утро");
	ГрафикТемпературы.Точки.Добавить(2);
	ГрафикТемпературы.Точки[2].Текст = ?(ЭтоТекущийПериод, "6:00", "День");
	ГрафикТемпературы.Точки.Добавить(3);
	ГрафикТемпературы.Точки[3].Текст = ?(ЭтоТекущийПериод, "9:00", "Вечер");

	Если ЭтоТекущийПериод Тогда
		ГрафикТемпературы.Точки.Добавить(4);
		ГрафикТемпературы.Точки[4].Текст = "12:00";
		ГрафикТемпературы.Точки.Добавить(5);
		ГрафикТемпературы.Точки[5].Текст = "15:00";
		ГрафикТемпературы.Точки.Добавить(6);
		ГрафикТемпературы.Точки[6].Текст = "18:00";
		ГрафикТемпературы.Точки.Добавить(7);
		ГрафикТемпературы.Точки[7].Текст = "21:00";
			
		УстановитьРасшифровкуТочек();
		
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура УстановитьРасшифровкуТочек()
	ГрафикТемпературы.Точки[0].Расшифровка = "0 часов 00 минут";
	ГрафикТемпературы.Точки[1].Расшифровка = "3 часа 00 минут";
	ГрафикТемпературы.Точки[2].Расшифровка = "6 часов 00 минут";
	ГрафикТемпературы.Точки[3].Расшифровка = "9 часов 00 минут";
	ГрафикТемпературы.Точки[4].Расшифровка = "12 часов 00 минут";
	ГрафикТемпературы.Точки[5].Расшифровка = "15 часов 00 минут";
	ГрафикТемпературы.Точки[6].Расшифровка = "18 часов 00 минут";
	ГрафикТемпературы.Точки[7].Расшифровка = "21 часов 00 минут";
КонецПроцедуры


&НаСервере
Функция ПреобразоватьТекстВЧисло(ТекЗначение)

	//ТекстСтрока = СтрЗаменить(ТекЗначение, "+", "");
	//ТекстСтрока = СтрЗаменить(ТекстСтрока, "-", "");
	ТекстСтрока = СтрЗаменить(ТекЗначение, "°", "");
	ТекстСтрока = СтрЗаменить(ТекстСтрока, "C", "");
	ТекстСтрока = СтрЗаменить(ТекстСтрока, "С", "");
	ТекстСтрока = СтрЗаменить(ТекстСтрока, " ", "");
	ТекстСтрока = СокрЛП(ТекстСтрока);

	Попытка
		ТекстСтрока = Число(ТекстСтрока);
	Исключение
		ТекстСтрока = 0;
	КонецПопытки;

	Возврат ТекстСтрока;

КонецФункции